 %%%%%%%%%%%%%%%%%%%%%% 该程序主要用于介绍loglog函数的用法%%%%%%%%%%%%%%%
%%% 其中x为自变量，y为因变量
x=linspace(1,100,100);		%线性等分步长间距，间距为１，范围为［1，100］
y=exp(x);						%函数表达式，自变量ｘ与变量ｙ的关系
loglog(x,y)					%在双对数坐标轴中绘制函数曲线图形，即ｘ为对数坐标轴，ｙ也为对数坐标轴
%%  得到如图5-13所示的图形
%%%%%%%%%%%%%%%%%% 该程序主要用于介绍semilogy函数的用法%%%%%%%%%%%%%%
x=linspace(1,100,100);		%线性等分步长间距，间距为１，范围为［1，100］
y=exp(x);						%函数表达式，自变量ｘ与变量ｙ的关系
semilogy(x,y)			%绘制函数图形，其中y轴为对数坐标轴，而ｘ轴为实数坐标
%%% 得到如图5-14所示的图
%%%%%%%%%%%%%%%%%% 该程序主要用于介绍semilogxy函数的用法%%%%%%%%%%%%%%
x=linspace(1,100,100);		%线性等分步长间距，间距为１，范围为［1，100］
y=exp(x);						%函数表达式，自变量ｘ与变量ｙ的关系
semilogxy(x,y)			%绘制函数图形，其中ｘ轴为对数坐标轴，而ｙ轴为实数坐标
%%% 得到如图5-15所示的图

