%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%该程序用于绘制分段函数
%%%%%%%%%%%%%%%%%%   当0<x<1时，y=x；  %%%%%%%%%%%%%%%%%%%%
x=0:0.1:1;		% 设置等间距步长，间隔为0.1,范围是[0，1]
y=x;			% 第一段函数表达式，自变量ｘ与变量ｙ之间的关系
plot(x,y)		%绘制图形，得到如图5-7所示的图形
hold on
%%% 利用hold on 命令保持当前的图形，将此后绘制的所有图形都继续添加到当前的图形窗口中；
%%% 如果新的曲线所对应的坐标极限值与原来的图形不一致，则由系统自动进行调整。
%%% 得到如图5-7所示的图形
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%该程序用于绘制分段函数的第二部分
%%%%%%%%%%%%%%%%%%   当1<x<2时，y=0.5x4+0.5； %%%%%%%%%%%%%%%%%%%%%%%%%%
x=1:0.1:2;				% 设置等间距步长，间隔为0.1,范围是[0，1]
y=0.5*x.^4+0.5;		% 第二段函数表达式，自变量ｘ与变量ｙ之间的关系
plot(x,y)				% 绘制函数图形,得到如图5-8所示的图形
%%% 得到如图5-8所示的图形
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%该程序用于绘制分段函数的第三部分
%%%%%%%%%%%%%%%%%%   当2<x<5时，y= -x2+9x-5.5；%%%%%%%%%%%%%%%%%%
x=2:0.1:5;				% 设置等间距步长，间隔为0.1,范围是[0，1]
y=-x.^2+9*x-5.5;		% 第三段函数表达式，自变量ｘ与变量ｙ的关系
plot(x,y)				% 绘制函数图形，得到如图5-8所示的图形
%%%  得到如图5-9所示的图形（最终图形）

