t=0:5:60;
y=[0.2 0.4 0.5 0.9 1.5 2.4 3.1 3.8 4.1 4.2 4.5 4.4 4.5];
f=@(b,x)1./(b(1)+b(2)*exp(b(3)*x));  % 定义拟合函数模型
x = lsqcurvefit(f,[0.5,10,0],t,y)  % 最小二乘拟合求解
plot(t,y,'ko',t,f(x,t))  % 绘制图形
hold on  % 图形保持
plot([39.3,38.5,38.5,37.7,38.5,38.5,39.3],...
    [2.1,2.05,1.55,1.5,1.45,0.95,0.9],'k')  % 绘制左括弧
h(1)=text(40,2,['{\ita}=',num2str(x(1))]);  % 添加标注
h(2)=text(40,1.5,['{\itb}=',num2str(x(2))]);  % 添加标注
h(3)=text(40,1,['{\itc}=',num2str(x(3))]);  % 添加标注
set(h,'fontname','times','fontsize',12)  % 设置标注的字号与字形



