%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 以下代码用于使用cheb1ord函数和cheby1函数设计Chebyshev I型数字滤波器
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 参数fs用于设计滤波器的采样频率
fs=1000;
% 参数wp用于设定滤波器的通带边界的频率，并使得参数wp的值在[0,1]之间
wp=[100 200]*2/fs;
% 参数ws用于设定滤波器的截止频率，并使得参数ws的值在[0,1]之间
ws=[30 300]*2/fs;
% 参数rp用于指定滤波器的通带纹波
rp=3;
% 参数rs用于指定滤波器的阻带衰减
rs=30;
% 设置滤波器频率响应的采样点数
Nn=128;
% 利用cheb1ord函数来生成带通Chebyshev I型模拟滤波器
[N, wn]=cheb1ord(wp,ws,rp,rs);
% 利用cheby1函数来生成Chebyshev I型滤波器
[b,a]=cheby1(N,rp,wn)
% 利用freqz函数来绘制出滤波器的频率响应函数曲线。其中参数a,b是滤波器的系数；参数Nn为系统的采样频率；参数fs为滤波器的采样频率
freqz(b,a,Nn,fs)
% 得到如图11-9所示的图形
