%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 以下代码用于求解一阶动态电路的参数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 设置一阶电路的参数值
R1=3;us=18;is=3;R2=12;R3=6;C=1;

% 显示提示符：求解问题1
display('question 1')
% 对参数uc0进行设置，并且求解在t=0时刻参数ir2以及ir3的值
uc0=-12; ir20=uc0/R2; ir30=uc0/R3;
% 根据基尔霍夫电流定律求解在t=0时刻电流ic的值
ic0=is-ir20-ir30;
% 根据并联电路电流的分配原则求解支路电流ir2f的值
ir2f=is*R3/(R2+R3);
% 根据并联电路电流的分配原则求解支路电流ir3f的值
ir3f=is*R2/(R2+R3);
% 根据电流值求解电阻R2上的电压
ucf=ir2f*R2;
% 断开开关s,此时电流为0
icf=0;
% 对时间参数t进行设置。将时间t分为三个阶段0-9，10，11-20，其中10为开关动作的一个瞬态响应
t=[-2-eps:0-eps, 0:9, 10-eps, 10+eps, 11:20];
% 创建图形1，绘制参数t的图形
figure(1),plot(t),grid
% 对t在1-3区间内uc以及ir2的数值
uc(1:3)=-12;ir2(1:3)=3;
% 计算一阶电路的时间响应常数T
T=R2*R3/(R2+R3)*C;
% 计算时间t在4-14上的电压值
uc(4:14)=ucf+(uc0-ucf)*exp(-t(4:14)/T);
% 计算时间t在4-14上电流的值
ir2(4:14)=ir2f+(ir20-ir2f)*exp(-t(4:14)/T);

% 显示提示符：求解问题2
display('question 2')
% 计算t在15时间上的电压和电流的值
uc(15)=uc(14); ir2(15)=is;
% 对电路中的电压源和电流源进行赋值
ucf2=-12; ir2f=is;
% 计算开关切换后电路的时间常数
T2=R1*R3/(R1+R3)*C;
% 计算t在15-25处的电压值
uc(15:25)=ucf2+(uc(15)-ucf2)*exp(-t(15:25)-t(15))/T2);
