%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
本代码主要用于求解频域系统的特征响应参数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 构建传递函数分子的系数矩阵
b=[1, 2, 1];
% 构建传递函数分母的系数矩阵
a=[2+sqrt(2), 0, 2-sqrt(2)];
% 设置系统的采样点数为100
N=100;
% 根据不同的N值计算所对应的w的值
w=[0:N-1]*pi/N;
% 利用polyval函数实现对系统的响应进行求解
% 在这条命令语句中，首先通过polyval(a,exp(i,w))对参数a在exp(i,w)出进行多项式的拟合；然后再通过polyval(b,exp(i*w)/拟合值)来求解系统的响应
H=polyval(b,exp(i*w))./polyval(a,exp(i*w));
% 创建图形1，并以子图的形式在直角坐标中绘制函数曲线，得到如图11-6所示的图形
figure(1)
% 绘制子图1，描述系统在复频域直角坐标轴中的幅值abs(H)与角频域w的关系
subplot(2,1,1),plot(w,abs(H)),grid
% 绘制子图2，描述系统在复频域直角坐标轴中的幅角angle(H)与角频域w的关系
subplot(2,1,2),plot(w,unwrap(angle(H))),grid
% 创建图形2，并以子图的形式绘制函数曲线，得到如图11-7所示的图形
figure(2)
% 绘制子图1，描述系统在复频域对数坐标轴中的幅值abs(H)与角频域w的关系
subplot(2,1,1), semilogx(w,20*log10(abs(H))),grid
% 绘制子图1，描述系统在复频域对数坐标轴中的幅角angle(H)与角频域w的关系
subplot(2,1,2), semilogx(w,unwrap(angle(H))),grid
