%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 以下代码用于求解电阻电路的参数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 清空当前工作区间中所有变量
clear,close all, format compact
% 根据题目中的已知条件，对各个元件进行赋值
R1=2;R2=4;R3=12;R4=4;R5=12;R6=4;R7=2;
% 输出提示符号“question 1: ”
display('question 1:')
% 对方程组中的元素a11，a12，a13分别进行赋值
a11=R1+R2+R3;a12=-R3;a13=0;
% 对方程组中的元素a21，a22，a23分别进行赋值
a21=-R3;a22=R3+R4+R5;a23=-R5;
% 对方程组中的元素a31，a32，a33分别进行赋值
a31=0;a32=-R5;a33=R5+R6+R7;
% 对方程组中的元素b1，b2，b3分别进行赋值
b1=1;b2=0;b3=0;
% 对us进行赋值
us=10;
% 构建方程组的系数矩阵
A=[a11,a12,a13;a21,a22,a23;a31,a32,a33];
% 构建方程组的常数项矩阵
B=[b1;0;0];
% 求解方程组的解
I=A\B*us;
% 求解得到ia的值
ia=I(1);
% 求解得到ib的值
ib=I(2);
% 求解得到ic的值
ic=I(3);
% 求解得到i3=ia-ib的值
i3=ia-ib
% 求解得到u4=R4*ib的值
u4=R4*ib
% 求解得到u7=R7*ic的值
u7=R7*ic
% 输出提示符号“question 2: ”
display('question 2')
% 对参数u42进行赋值
u42=6;
% 求解表达式k1=i3/us的值
k1=i3/us;
% 求解表达式k2=u4/us的值
k2=u4/us;
% 求解表达式k3=u7/us的值
k3=u7/us;
% 求解表达式us2=u42/k2的值
us2=u42/k2
% 求解表达式i32=k1/k2*u42的值
i32=k1/k2*u42
% 求解表达式u72=k3/k2*u42的值
u72=k3/k2*u42
