%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%以下代码用于设计FIR滤波器,查看滤波器的频率响应并与理想滤波器进行比较
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 构建滤波器的频率区间
f=[0 0.125 0.125 0.25 0.25 0.5 0.5 0.75 0.75 1];
% 构建滤波器在各自频率区间上的幅度
m=[1 1 0.5 0.5 0.25 0.25 1/6 1/6 0.125 0.125];
%　利用fir2函数进行滤波器的设计，其中参数60为滤波器的阶数；参数f和参数m用于指定滤波器的频率响应函数
b=fir2(60,f,m)
% 利用freqz函数求解系统的幅值相位响应。其中参数b滤波器的系数；参数H则返回系统频率响应的复变量。
[h,w]=freqz(b);
% 分别绘制理想滤波器和设计滤波器的曲线。其中参数f,m用于绘制理想滤波器的曲线；参数w/pi,abs(h)用于绘制设计滤波器的曲线。abs函数用于求解滤波器复变量的模
plot(f,m,w/pi,abs(h))
% 生成网格点，用于两条曲线之间的对比
grid on
% 为图形添加标题'设计滤波器与理想滤波器幅度频率特性比较'
title('设计滤波器与理想滤波器幅度频率特性比较');
% 为图形横坐标添加标题'归一化频率'
xlabel('归一化频率');
% 为图形横坐标添加标题'幅度'
ylabel('幅度');
% 得到如图11-9所示的图形
