%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 以下代码用于实现图片的二维DCT变换和反变换
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 在MATLAB路径中打开一个名为a.jpg图片
rgb=imread('a.jpg');
% 创建图形1
figure(1)
% 显示MATLAB中的图片（源图片）
imshow(rgb);
% 得到如图11-22所示的图形
% 利用rgb2gray函数将源图片转换成灰度图片
I=rgb2gray(rgb);
% 创建图形2
figure(2)
% 显示转换后的灰度图形
imshow(I);
% 得到如图11-23所示的图形
% --------------- 以下代码主要实现对图片的二维余弦变换 -------------
% 利用dct2函数对图像进行二维余弦变换
J=dct2(I);
% 创建图形3
figure(3)
% 在对数坐标中查看余弦变换后的图形
imshow(log(abs(J)),[]);
% 设置图形的色彩
colormap(jet(64));
% 为图形添加色条
colorbar;
% 得到如图11-24所示的图形
% 将DCT变换值小于11的元素设置为0
J(abs(J)<11)=0;
% 利用idct2函数对图形进行二维余弦反变换
K=idct2(J)/255;
% 创建图形4
figure(4);
% 查看反余弦变换后的图形
imshow(K) 
% 得到如图11-25所示的图形


