function example_11_23
x=nan*ones(4,7);  % 初始化，7个状态变量，每个最多4种取值
x(1,1)=1;x(1:2,2)=[2;3];
x(1:4,3)=(4:7)';
x(1:3,4)=(8:10)';
x(1:3,5)=(11:13)';
x(1:2,6)=[14;15];
x(1,7)=16;
[p,f]=dynprog(x,@dynfun1,@dynfun2,@dynfun3)
%======决策变量值的求解函数======%
function u=dynfun1(k,x)
% 在阶段k由状态变量x的值求出其相应的决策变量所有的取值
if x==1
    u=[2;3];
elseif x==2
    u=[4;5;6];
elseif x==3
    u=[5;6;7];
elseif x==4|x==5
    u=[8;9];
elseif x==6|x==7
    u=[9;10];
elseif x==8
    u=[11;12];
elseif x==9|x==10
    u=[12;13];
elseif x==11|x==12|x==13
    u=[14;15];
elseif x==14|x==15
    u=16;
elseif x==16
    u=16;
end
%======各阶段的指标函数值求解函数======%
function v=dynfun2(k,x,u)
% 求解各阶段指标函数值
tt=[5;3;2;3;6;8;7;16;6;8;3;5;3;3;8;4;2;2;1;2;3;3;3;5;5;2;6;6;4;3];
tmp=[x==1&u==2,x==1&u==3,x==2&u==4,x==2&u==5,x==2&u==6,...
     x==3&u==5,x==3&u==6,x==3&u==7,x==4&u==8,x==4&u==9,...
     x==5&u==8,x==5&u==9,x==6&u==9,x==6&u==10,...
     x==7&u==9,x==7&u==10,x==8&u==11,x==8&u==12,...
     x==9&u==12,x==9&u==13,x==10&u==12,x==10&u==13,...
     x==11&u==14,x==11&u==15,x==12&u==14,x==12&u==15,...
     x==13&u==14,x==13&u==15,x==14&u==16,x==15&u==16];
v=tmp*tt;
%======状态转移方程描述函数======%
function y=dynfun3(k,x,u)
% 状态转移方程
y=u;
